TexasInstruments/c2000ware-core-sdk/device_support/f2806x/MWare/driverlib/usb.c
    // Endpoint zero is configured differently than the other endpoints, so see
    // if this is endpoint zero.
    if(ulEndpoint == USB_EP_0)
    {
        // Set the NAK timeout.
        HWREGB(ulBase + USB_O_NAKLMT) = ulNAKPollInterval;

        // Set the transfer type information.
        HWREGB(ulBase + USB_O_TYPE0) =
            ((ulFlags & USB_EP_SPEED_FULL) ? USB_TYPE0_SPEED_FULL :
             USB_TYPE0_SPEED_LOW);
    }
    else
    {
        // Start with the target endpoint.
        ulRegister = ulTargetEndpoint;

        // Set the speed for the device using this endpoint.
        if(ulFlags & USB_EP_SPEED_FULL)
        {
            ulRegister |= USB_TXTYPE1_SPEED_FULL;
        }
        else
        {
            ulRegister |= USB_TXTYPE1_SPEED_LOW;
        }

        // Set the protocol for the device using this endpoint.
        switch(ulFlags & USB_EP_MODE_MASK)
        {
            // The bulk protocol is being used.
        case USB_EP_MODE_BULK:
        {
            ulRegister |= USB_TXTYPE1_PROTO_BULK;
            break;
        }

        // The isochronous protocol is being used.
        case USB_EP_MODE_ISOC:
        {
            ulRegister |= USB_TXTYPE1_PROTO_ISOC;
            break;
        }

        // The interrupt protocol is being used.
        case USB_EP_MODE_INT:
        {
            ulRegister |= USB_TXTYPE1_PROTO_INT;
            break;
        }

        // The control protocol is being used.
        case USB_EP_MODE_CTRL:
        {
            ulRegister |= USB_TXTYPE1_PROTO_CTRL;
            break;
        }
        }

        // See if the transmit or receive endpoint is being configured.
        if(ulFlags & USB_EP_HOST_OUT)
        {
            // Set the transfer type information.
            HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_TXTYPE1) =
                ulRegister;

            // Set the NAK timeout or polling interval.
            HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_TXINTERVAL1) =
                ulNAKPollInterval;

            // Set the Maximum Payload per transaction.
            HWREGH(ulBase + EP_OFFSET(ulEndpoint) + USB_O_TXMAXP1) =
                ulMaxPayload;

            // Set the transmit control value to zero.
            ulRegister = 0;

            // Allow auto setting of TxPktRdy when max packet size has been
            // loaded into the FIFO.
            if(ulFlags & USB_EP_AUTO_SET)
            {
                ulRegister |= USB_TXCSRH1_AUTOSET;
            }

            // Configure the DMA Mode.
            if(ulFlags & USB_EP_DMA_MODE_1)
            {
                ulRegister |= USB_TXCSRH1_DMAEN | USB_TXCSRH1_DMAMOD;
            }
            else if(ulFlags & USB_EP_DMA_MODE_0)
            {
                ulRegister |= USB_TXCSRH1_DMAEN;
            }

            // Write out the transmit control value.
            HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_TXCSRH1) =
                (uint8_t)ulRegister;
        }
        else
        {
            // Set the transfer type information.
            HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_RXTYPE1) =
                ulRegister;

            // Set the NAK timeout or polling interval.
            HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_RXINTERVAL1) =
                ulNAKPollInterval;

            // Set the Maximum Payload per transaction.
            HWREGH(ulBase + EP_OFFSET(ulEndpoint) + USB_O_RXMAXP1) =
                ulMaxPayload;

            //
            // Set the receive control value to zero.
            ulRegister = 0;

            // Allow auto clearing of RxPktRdy when packet of size max packet
            // has been unloaded from the FIFO.
            if(ulFlags & USB_EP_AUTO_CLEAR)
            {
                ulRegister |= USB_RXCSRH1_AUTOCL;
            }

            // Configure the DMA Mode.
            if(ulFlags & USB_EP_DMA_MODE_1)
            {
                ulRegister |= USB_RXCSRH1_DMAEN | USB_RXCSRH1_DMAMOD;
            }
            else if(ulFlags & USB_EP_DMA_MODE_0)
            {
                ulRegister |= USB_RXCSRH1_DMAEN;
            }

            // Write out the receive control value.
            HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_RXCSRH1) =
                (uint8_t)ulRegister;
        }
    }
}

//*****************************************************************************
//! Sets the configuration for an endpoint.
//!
//! \param ulBase specifies the USB module base address.
//! \param ulEndpoint is the endpoint to access.
//! \param ulMaxPacketSize is the maximum packet size for this endpoint.
//! \param ulFlags are used to configure other endpoint settings.
//!
//! This function sets the basic configuration for an endpoint in device mode.
//! Endpoint zero does not have a dynamic configuration, so this function
//! should not be called for endpoint zero.  The \e ulFlags parameter
//! determines some of the configuration while the other parameters provide the
//! rest.
//!
//! The \b USB_EP_MODE_ flags define what the type is for the given endpoint.
//!
//! - \b USB_EP_MODE_CTRL is a control endpoint.
//! - \b USB_EP_MODE_ISOC is an isochronous endpoint.
//! - \b USB_EP_MODE_BULK is a bulk endpoint.
//! - \b USB_EP_MODE_INT is an interrupt endpoint.
//!
//! The \b USB_EP_DMA_MODE_ flags determine the type of DMA access to the
//! endpoint data FIFOs.  The choice of the DMA mode depends on how the DMA
//! controller is configured and how it is being used.  See the ``Using USB
//! with the uDMA Controller'' section for more information on DMA
//! configuration.
//!
//! When configuring an IN endpoint, the \b USB_EP_AUTO_SET bit can be
//! specified to cause the automatic transmission of data on the USB bus as
//! soon as \e ulMaxPacketSize bytes of data are written into the FIFO for
//! this endpoint.  This option is commonly used with DMA as no interaction is
//! required to start the transmission of data.
//!
//! When configuring an OUT endpoint, the \b USB_EP_AUTO_REQUEST bit is
//! specified to trigger the request for more data once the FIFO has been
//! drained enough to receive \e ulMaxPacketSize more bytes of data.  Also for
//! OUT endpoints, the \b USB_EP_AUTO_CLEAR bit can be used to clear the data
//! packet ready flag automatically once the data has been read from the FIFO.
//! If this option is not used, this flag must be manually cleared via a call 
//! to USBDevEndpointStatusClear().  Both of these settings can be used to 
//! remove the need for extra calls when using the controller in DMA mode.
//!
//! \note This function should only be called in device mode.
//!
//! \return None.
//*****************************************************************************
void
USBDevEndpointConfigSet(uint32_t ulBase, uint32_t ulEndpoint,
                        uint32_t ulMaxPacketSize, uint32_t ulFlags)
{
    uint32_t ulRegister;

    // Check the arguments.
    ASSERT(ulBase == USB0_BASE);
    ASSERT((ulEndpoint == USB_EP_1) || (ulEndpoint == USB_EP_2) ||
           (ulEndpoint == USB_EP_3) || (ulEndpoint == USB_EP_4) ||
           (ulEndpoint == USB_EP_5) || (ulEndpoint == USB_EP_6) ||
           (ulEndpoint == USB_EP_7));

