TexasInstruments/c2000ware-core-sdk/device_support/f2806x/MWare/driverlib/usb.c
    // Determine if a transmit or receive endpoint is being configured.
    if(ulFlags & USB_EP_DEV_IN)
    {
        // Set the maximum packet size.
        HWREGH(ulBase + EP_OFFSET(ulEndpoint) + USB_O_TXMAXP1) =
            ulMaxPacketSize;

        // The transmit control value is zero unless options are enabled.
        ulRegister = 0;

        // Allow auto setting of TxPktRdy when max packet size has been loaded
        // into the FIFO.
        if(ulFlags & USB_EP_AUTO_SET)
        {
            ulRegister |= USB_TXCSRH1_AUTOSET;
        }

        // Configure the DMA mode.
        if(ulFlags & USB_EP_DMA_MODE_1)
        {
            ulRegister |= USB_TXCSRH1_DMAEN | USB_TXCSRH1_DMAMOD;
        }
        else if(ulFlags & USB_EP_DMA_MODE_0)
        {
            ulRegister |= USB_TXCSRH1_DMAEN;
        }

        // Enable isochronous mode if requested.
        if((ulFlags & USB_EP_MODE_MASK) == USB_EP_MODE_ISOC)
        {
            ulRegister |= USB_TXCSRH1_ISO;
        }

        // Write the transmit control value.
        HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_TXCSRH1) =
            (uint8_t)ulRegister;

        // Reset the Data toggle to zero.
        HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_TXCSRL1) =
            USB_TXCSRL1_CLRDT;
    }
    else
    {
        // Set the MaxPacketSize.
        HWREGH(ulBase + EP_OFFSET(ulEndpoint) + USB_O_RXMAXP1) =
            ulMaxPacketSize;

        // The receive control value is zero unless options are enabled.
        ulRegister = 0;

        // Allow auto clearing of RxPktRdy when packet of size max packet
        // has been unloaded from the FIFO.
        if(ulFlags & USB_EP_AUTO_CLEAR)
        {
            ulRegister = USB_RXCSRH1_AUTOCL;
        }

        // Configure the DMA mode.
        if(ulFlags & USB_EP_DMA_MODE_1)
        {
            ulRegister |= USB_RXCSRH1_DMAEN | USB_RXCSRH1_DMAMOD;
        }
        else if(ulFlags & USB_EP_DMA_MODE_0)
        {
            ulRegister |= USB_RXCSRH1_DMAEN;
        }

        // Enable isochronous mode if requested.
        if((ulFlags & USB_EP_MODE_MASK) == USB_EP_MODE_ISOC)
        {
            ulRegister |= USB_RXCSRH1_ISO;
        }

        // Write the receive control value.
        HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_RXCSRH1) =
            (uint8_t)ulRegister;

        // Reset the Data toggle to zero.
        HWREGB(ulBase + EP_OFFSET(ulEndpoint) + USB_O_RXCSRL1) =
            USB_RXCSRL1_CLRDT;
    }
}

//*****************************************************************************
//! Gets the current configuration for an endpoint.
//!
//! \param ulBase specifies the USB module base address.
//! \param ulEndpoint is the endpoint to access.
//! \param pulMaxPacketSize is a pointer which is written with the maximum
//! packet size for this endpoint.
//! \param pulFlags is a pointer which is written with the current endpoint
//! settings.  On entry to the function, this pointer must contain either
//! \b USB_EP_DEV_IN or \b USB_EP_DEV_OUT to indicate whether the IN or OUT
//! endpoint is to be queried.
//!
//! This function returns the basic configuration for an endpoint in device
//! mode. The values returned in \e *pulMaxPacketSize and \e *pulFlags are
//! equivalent to the \e ulMaxPacketSize and \e ulFlags previously passed to
//! USBDevEndpointConfigSet() for this endpoint.
//!
//! \note This function should only be called in device mode.
//!
//! \return None.
//*****************************************************************************
void
USBDevEndpointConfigGet(uint32_t ulBase, uint32_t ulEndpoint,
                        uint32_t *pulMaxPacketSize,
                        uint32_t *pulFlags)
{
    uint32_t ulRegister;

    // Check the arguments.
    ASSERT(ulBase == USB0_BASE);
    ASSERT(pulMaxPacketSize && pulFlags);
    ASSERT((ulEndpoint == USB_EP_1) || (ulEndpoint == USB_EP_2) ||
           (ulEndpoint == USB_EP_3) || (ulEndpoint == USB_EP_4) ||
           (ulEndpoint == USB_EP_5) || (ulEndpoint == USB_EP_6) ||
           (ulEndpoint == USB_EP_7));

    // Determine if a transmit or receive endpoint is being queried.
    if(*pulFlags & USB_EP_DEV_IN)
    {
        // Clear the flags other than the direction bit.
        *pulFlags = USB_EP_DEV_IN;

        // Get the maximum packet size.
        *pulMaxPacketSize = (uint32_t)HWREGH(ulBase +
                            EP_OFFSET(ulEndpoint) +
                            USB_O_TXMAXP1);

        // Get the current transmit control register value.
        ulRegister = (uint32_t)HWREGB(ulBase + EP_OFFSET(ulEndpoint) +
                                           USB_O_TXCSRH1);

        // Are we allowing auto setting of TxPktRdy when max packet size has
        // been loaded into the FIFO?
        if(ulRegister & USB_TXCSRH1_AUTOSET)
        {
            *pulFlags |= USB_EP_AUTO_SET;
        }

        // Get the DMA mode.
        if(ulRegister & USB_TXCSRH1_DMAEN)
        {
            if(ulRegister & USB_TXCSRH1_DMAMOD)
            {
                *pulFlags |= USB_EP_DMA_MODE_1;
            }
            else
            {
                *pulFlags |= USB_EP_DMA_MODE_0;
            }
        }

        // Are we in isochronous mode?
        if(ulRegister & USB_TXCSRH1_ISO)
        {
            *pulFlags |= USB_EP_MODE_ISOC;
        }
        else
        {
            // The hardware doesn't differentiate between bulk, interrupt
            // and control mode for the endpoint so we just set something
            // that isn't isochronous.  This protocol ensures that anyone 
            // modifying the returned flags in preparation for a call to
            // USBDevEndpointConfigSet do not see an unexpected mode change.
            // If they decode the returned mode, however, they may be in for
            // a surprise.
            *pulFlags |= USB_EP_MODE_BULK;
        }
    }
    else
    {
        // Clear the flags other than the direction bit.
        *pulFlags = USB_EP_DEV_OUT;

        // Get the MaxPacketSize.
        *pulMaxPacketSize = (uint32_t)HWREGH(ulBase +
                            EP_OFFSET(ulEndpoint) +
                            USB_O_RXMAXP1);

        // Get the current receive control register value.
        ulRegister = (uint32_t)HWREGB(ulBase + EP_OFFSET(ulEndpoint) +
                                           USB_O_RXCSRH1);

        // Are we allowing auto clearing of RxPktRdy when packet of size max
        // packet has been unloaded from the FIFO?
        if(ulRegister & USB_RXCSRH1_AUTOCL)
        {
            *pulFlags |= USB_EP_AUTO_CLEAR;
        }

        // Get the DMA mode.
        if(ulRegister & USB_RXCSRH1_DMAEN)
        {
            if(ulRegister & USB_RXCSRH1_DMAMOD)
            {
                *pulFlags |= USB_EP_DMA_MODE_1;
            }
            else
            {
                *pulFlags |= USB_EP_DMA_MODE_0;
            }
        }

