TexasInstruments/c2000ware-core-sdk/device_support/f2806x/MWare/driverlib/usb.c
        // Return a failure since there is no data to read.
        return(-1);
    }

    // Get the byte count in the FIFO.
    ulByteCount = HWREGH(ulBase + USB_O_COUNT0 + ulEndpoint);

    // Determine how many bytes we will actually copy.
    ulByteCount = (ulByteCount < *pulSize) ? ulByteCount : *pulSize;

    // Return the number of bytes we are going to read.
    *pulSize = ulByteCount;

    // Calculate the FIFO address.
    ulFIFO = ulBase + USB_O_FIFO0 + (ulEndpoint >> 2);

    // Read the data out of the FIFO.
    for(; ulByteCount > 0; ulByteCount--)
    {
        // Read a byte at a time from the FIFO.
        *pucData++ = HWREGB(ulFIFO);
    }

    // Success.
    return(0);
}

//*****************************************************************************
//! Acknowledge that data was read from the given endpoint's FIFO in device
//! mode.
//!
//! \param ulBase specifies the USB module base address.
//! \param ulEndpoint is the endpoint to access.
//! \param bIsLastPacket indicates if this packet is the last one.
//!
//! This function acknowledges that the data was read from the endpoint's FIFO.
//! The \e bIsLastPacket parameter is set to a \b true value if this is the
//! last in a series of data packets on endpoint zero.  The \e bIsLastPacket
//! parameter is not used for endpoints other than endpoint zero.  This call
//! can be used if processing is required between reading the data and
//! acknowledging that the data has been read.
//!
//! \note This function should only be called in device mode.
//!
//! \return None.
//*****************************************************************************
void
USBDevEndpointDataAck(uint32_t ulBase, uint32_t ulEndpoint,
                      tBoolean bIsLastPacket)
{
    // Check the arguments.
    ASSERT(ulBase == USB0_BASE);
    ASSERT((ulEndpoint == USB_EP_0) || (ulEndpoint == USB_EP_1) ||
           (ulEndpoint == USB_EP_2) || (ulEndpoint == USB_EP_3) ||
           (ulEndpoint == USB_EP_4) || (ulEndpoint == USB_EP_5) ||
           (ulEndpoint == USB_EP_6) || (ulEndpoint == USB_EP_7));

    // Determine which endpoint is being acked.
    if(ulEndpoint == USB_EP_0)
    {
        // Clear RxPktRdy, and optionally DataEnd, on endpoint zero.
        HWREGB(ulBase + USB_O_CSRL0) =
            USB_CSRL0_RXRDYC | (bIsLastPacket ? USB_CSRL0_DATAEND : 0);
    }
    else
    {
        // Clear RxPktRdy on all other endpoints.
        HWREGB(ulBase + USB_O_RXCSRL1 + EP_OFFSET(ulEndpoint)) &=
            ~(USB_RXCSRL1_RXRDY);
    }
}

//*****************************************************************************
//! Acknowledge that data was read from the given endpoint's FIFO in host
//! mode.
//!
//! \param ulBase specifies the USB module base address.
//! \param ulEndpoint is the endpoint to access.
//!
//! This function acknowledges that the data was read from the endpoint's FIFO.
//! This call is used if processing is required between reading the data and
//! acknowledging that the data has been read.
//!
//! \note This function should only be called in host mode.
//!
//! \return None.
//*****************************************************************************
void
USBHostEndpointDataAck(uint32_t ulBase, uint32_t ulEndpoint)
{
    // Check the arguments.
    ASSERT(ulBase == USB0_BASE);
    ASSERT((ulEndpoint == USB_EP_0) || (ulEndpoint == USB_EP_1) ||
           (ulEndpoint == USB_EP_2) || (ulEndpoint == USB_EP_3) ||
           (ulEndpoint == USB_EP_4) || (ulEndpoint == USB_EP_5) ||
           (ulEndpoint == USB_EP_6) || (ulEndpoint == USB_EP_7));

    // Clear RxPktRdy.
    if(ulEndpoint == USB_EP_0)
    {
        HWREGB(ulBase + USB_O_CSRL0) &= ~USB_CSRL0_RXRDY;
    }
    else
    {
        HWREGB(ulBase + USB_O_RXCSRL1 + EP_OFFSET(ulEndpoint)) &=
            ~(USB_RXCSRL1_RXRDY);
    }
}

//*****************************************************************************
//! Puts data into the given endpoint's FIFO.
//!
//! \param ulBase specifies the USB module base address.
//! \param ulEndpoint is the endpoint to access.
//! \param pucData is a pointer to the data area used as the source for the
//! data to put into the FIFO.
//! \param ulSize is the amount of data to put into the FIFO.
//!
//! This function puts the data from the \e pucData parameter into the FIFO
//! for this endpoint.  If a packet is already pending for transmission, then
//! this call does not put any of the data into the FIFO and returns -1. Care
//! should be taken to not write more data than can fit into the FIFO
//! allocated by the call to USBFIFOConfigSet().
//!
//! \return This call returns 0 on success, or -1 to indicate that the FIFO
//! is in use and cannot be written.
//*****************************************************************************
int32_t
USBEndpointDataPut(uint32_t ulBase, uint32_t ulEndpoint,
                   uint8_t *pucData, uint32_t ulSize)
{
    uint32_t ulFIFO;
    uint8_t ucTxPktRdy;

    // Check the arguments.
    ASSERT(ulBase == USB0_BASE);
    ASSERT((ulEndpoint == USB_EP_0) || (ulEndpoint == USB_EP_1) ||
           (ulEndpoint == USB_EP_2) || (ulEndpoint == USB_EP_3) ||
           (ulEndpoint == USB_EP_4) || (ulEndpoint == USB_EP_5) ||
           (ulEndpoint == USB_EP_6) || (ulEndpoint == USB_EP_7));

    // Get the bit position of TxPktRdy based on the endpoint.
    if(ulEndpoint == USB_EP_0)
    {
        ucTxPktRdy = USB_CSRL0_TXRDY;
    }
    else
    {
        ucTxPktRdy = USB_TXCSRL1_TXRDY;
    }

    // Don't allow transmit of data if the TxPktRdy bit is already set.
    if(HWREGB(ulBase + USB_O_CSRL0 + ulEndpoint) & ucTxPktRdy)
    {
        return(-1);
    }

    // Calculate the FIFO address.
    ulFIFO = ulBase + USB_O_FIFO0 + (ulEndpoint >> 2);

    // Write the data to the FIFO.
    for(; ulSize > 0; ulSize--)
    {
        HWREGB(ulFIFO) = *pucData++;
    }

    // Success.
    return(0);
}

//*****************************************************************************
//! Starts the transfer of data from an endpoint's FIFO.
//!
//! \param ulBase specifies the USB module base address.
//! \param ulEndpoint is the endpoint to access.
//! \param ulTransType is set to indicate what type of data is being sent.
//!
//! This function starts the transfer of data from the FIFO for a given
//! endpoint.  This function should be called if the \b USB_EP_AUTO_SET bit was  
//! not enabled for the endpoint.  Setting the \e ulTransType parameter allows 
//! the appropriate signaling on the USB bus for the type of transaction being
//! requested.  The \e ulTransType parameter should be one of the following:
//!
//! - \b USB_TRANS_OUT for OUT transaction on any endpoint in host mode.
//! - \b USB_TRANS_IN for IN transaction on any endpoint in device mode.
//! - \b USB_TRANS_IN_LAST for the last IN transaction on endpoint zero in a
//!   sequence of IN transactions.
//! - \b USB_TRANS_SETUP for setup transactions on endpoint zero.
//! - \b USB_TRANS_STATUS for status results on endpoint zero.
//!
//! \return This call returns 0 on success, or -1 if a transmission is already
//! in progress.
//
//*****************************************************************************
int32_t
USBEndpointDataSend(uint32_t ulBase, uint32_t ulEndpoint,
                    uint32_t ulTransType)
{
    uint32_t ulTxPktRdy;

    // CHeck the arguments.
    ASSERT(ulBase == USB0_BASE);
    ASSERT((ulEndpoint == USB_EP_0) || (ulEndpoint == USB_EP_1) ||
           (ulEndpoint == USB_EP_2) || (ulEndpoint == USB_EP_3) ||
           (ulEndpoint == USB_EP_4) || (ulEndpoint == USB_EP_5) ||
           (ulEndpoint == USB_EP_6) || (ulEndpoint == USB_EP_7));

    // Get the bit position of TxPktRdy based on the endpoint.
    if(ulEndpoint == USB_EP_0)
    {
        // Don't allow transmit of data if the TxPktRdy bit is already set.
        if(HWREGB(ulBase + USB_O_CSRL0) & USB_CSRL0_TXRDY)
        {
            return(-1);
        }

